# Задание 1
def s_length(str):
    str = input('Напишите строку ')
    return len(str)
print('Длина строки = ', s_length(str))