# Задание 4


n = int(input('Введите число '))
if n>100 or n<-100:
    print('-')
else:
    print('+')
