# Задание 7

years = int(input('Введите кол-во лет'))
month = int(input('Введите кол-во месяцев'))

print ('Количество дней', years*12*29 + month*29)